БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиОбновленияСправочниковЕГИСЗ/НастройкиОбновленияСправочниковЕГИСЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиОбновленияСправочниковЕГИСЗ</name>
  <resources>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>РежимОбновления</name>
    <type>
      <types>EnumRef.РежимыАвтоОбновленияСправочниковЕГИСЗ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВерсии</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>Классификатор</name>
    <comment>OID классификатора</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/РежимыАвтоОбновленияСправочниковЕГИСЗ/РежимыАвтоОбновленияСправочниковЕГИСЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыАвтоОбновленияСправочниковЕГИСЗ</name>
  <enumValues>
    <name>Выключено</name>
    <comment>Автообновление выключено</comment>
  </enumValues>
  <enumValues>
    <name>Полное</name>
    <comment>Полностью автоматическое обновление</comment>
  </enumValues>
  <enumValues>
    <name>ТолькоЗагруженных</name>
    <comment>Автоматически обновлять только загруженные ранее</comment>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/НастройкиОбновленияСправочниковЕГИСЗ/RecordSetModule.bsl
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	// Если для классификатора поменяли режим обновления на более полный (ручной->полный или выкл->любой другой),
	//	то очищаем версию классификатора, чтобы следующее обновление актуализировано классификатор.
	Если ЭтотОбъект.Количество() = 1 Тогда
		
		пчРежимы = Перечисления.РежимыАвтоОбновленияСправочниковЕГИСЗ;
		
		Запись = ЭтотОбъект[0];
		Если Запись.РежимОбновления <> пчРежимы.Выключено Тогда
			
			ПредыдущееЗначение = РегистрыСведений.НастройкиОбновленияСправочниковЕГИСЗ.СоздатьМенеджерЗаписи();
			ПредыдущееЗначение.Классификатор = Запись.Классификатор;
			ПредыдущееЗначение.Прочитать();
			Если ПредыдущееЗначение.Выбран() Тогда
				Если Запись.РежимОбновления <> ПредыдущееЗначение.РежимОбновления
					И ((ПредыдущееЗначение.РежимОбновления = пчРежимы.Выключено) 
						Или ПредыдущееЗначение.РежимОбновления = пчРежимы.ТолькоЗагруженных И Запись.РежимОбновления = пчРежимы.Полное)
				Тогда
					Запись.Версия = ""; // Очищаем версию.
					Запись.ДатаВерсии = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
